app/controllers/links_controller.rb

SELECT "links".* FROM "links"
---
  def index
    links = Link.all

INSERT INTO "links" ("original_url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["original_url", "https://{\"original_url\"=>\"ffff\"}"], ["created_at", "2021-07-05 19:53:18.928224"], ["updated_at", "2021-07-05 19:53:18.928224"]]
---
  def create
    link = Link.new(original_url: "https://#{link_params[:domain]}")
    if link.save

UPDATE "links" SET "ip_addresses" = $1, "updated_at" = $2 WHERE "links"."id" = $3  [["ip_addresses", "{::1}"], ["updated_at", "2021-07-05 19:42:35.732893"], ["id", 1]]
---
  def redirect # rubocop:disable Metrics/AbcSize
    if link
      link.ip_addresses << request.remote_ip unless link.ip_addresses.include?(request.remote_ip)
      link.save

SELECT "links".* FROM "links" WHERE "links"."short_url" = $1 LIMIT $2  [["short_url", "b"], ["LIMIT", 1]]
---
  def link
    @link ||= Link.find_by(short_url: params[:path])